In [39]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1, 2, 3, 4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s[1]

2

In [5]:
s[[1, 3]]

1    2
3    4
dtype: int64

In [6]:
s[1:3]

1    2
2    3
dtype: int64

In [7]:
s2 = pd.Series([1, 2, 3, 4], 
               index = ['a', 'b', 'c', 'd'])
s2

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
s2[['a', 'd']]

a    1
d    4
dtype: int64

In [9]:
s.index, s2.index

(RangeIndex(start=0, stop=4, step=1),
 Index(['a', 'b', 'c', 'd'], dtype='object'))

In [10]:
dates = pd.date_range('2016-04-01', '2016-04-06')
temp1 = pd.Series([80, 82, 85, 90, 83, 87], index = dates)
temp2 = pd.Series([70, 75, 69, 83, 79, 77], index = dates)
temp1

2016-04-01    80
2016-04-02    82
2016-04-03    85
2016-04-04    90
2016-04-05    83
2016-04-06    87
Freq: D, dtype: int64

In [11]:
temp2

2016-04-01    70
2016-04-02    75
2016-04-03    69
2016-04-04    83
2016-04-05    79
2016-04-06    77
Freq: D, dtype: int64

In [12]:
temp1 - temp2

2016-04-01    10
2016-04-02     7
2016-04-03    16
2016-04-04     7
2016-04-05     4
2016-04-06    10
Freq: D, dtype: int64

In [13]:
s1 = pd.Series([1, 2], index=['a', 'b'])
s2 = pd.Series([4, 3], index=['b', 'a'])
s3 = pd.Series([5, 6], index=['b', 'c'])
s4 = pd.Series(range(1,11))
s1

a    1
b    2
dtype: int64

In [14]:
s2

b    4
a    3
dtype: int64

In [15]:
s3

b    5
c    6
dtype: int64

In [16]:
s4

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [17]:
#Alignment
s1+s2

a    4
b    6
dtype: int64

In [18]:
s1 * s2

a    3
b    8
dtype: int64

In [19]:
s1 + s3

a    NaN
b    7.0
c    NaN
dtype: float64

In [20]:
s4[s4>5]

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [21]:
s4[(s4<4) | (s4>7)]

0     1
1     2
2     3
7     8
8     9
9    10
dtype: int64

In [22]:
any(s4>5), all(s4>5), sum(s4>5)

(True, False, 5)

In [37]:
srgb = pd.Series(['red', 'green', 'blue'], index=[0, 3, 5])
srgb

0      red
3    green
5     blue
dtype: object

In [41]:
# forward fill
srgb.reindex(np.arange(0,7), method='ffill')

0      red
1      red
2      red
3    green
4    green
5     blue
6     blue
dtype: object

In [43]:
# backwards fill
srgb.reindex(np.arange(0,7), method='bfill')

0      red
1    green
2    green
3    green
4     blue
5     blue
6      NaN
dtype: object

In [23]:
temp_df = pd.DataFrame(
            {'Missoula': [80, 82, 85, 90, 83, 87], 
             'Philadelphia': [70, 75, 69, 83, 79, 77]},
             index=pd.date_range('2016-04-01', '2016-04-06'))
temp_df

            Missoula  Philadelphia
2016-04-01        80            70
2016-04-02        82            75
2016-04-03        85            69
2016-04-04        90            83
2016-04-05        83            79
2016-04-06        87            77

In [24]:
temp_df['Missoula']

2016-04-01    80
2016-04-02    82
2016-04-03    85
2016-04-04    90
2016-04-05    83
2016-04-06    87
Freq: D, Name: Missoula, dtype: int64

In [25]:
temp_df.Missoula

2016-04-01    80
2016-04-02    82
2016-04-03    85
2016-04-04    90
2016-04-05    83
2016-04-06    87
Freq: D, Name: Missoula, dtype: int64

In [26]:
temp_df[1:3]

            Missoula  Philadelphia
2016-04-02        82            75
2016-04-03        85            69

In [27]:
temp_df.Missoula[1:3]

2016-04-02    82
2016-04-03    85
Freq: D, Name: Missoula, dtype: int64

In [28]:
temp_df.iloc[1] #index location

Missoula        82
Philadelphia    75
Name: 2016-04-02 00:00:00, dtype: int64

In [29]:
temp_df.iloc[[1,3]]

            Missoula  Philadelphia
2016-04-02        82            75
2016-04-04        90            83

In [30]:
temp_df.loc['2016-04-03'] #location

Missoula        85
Philadelphia    69
Name: 2016-04-03 00:00:00, dtype: int64

In [31]:
temp2_df = temp_df
temp2_df['Difference'] = temp_df['Missoula'] - temp_df['Philadelphia']
temp2_df

            Missoula  Philadelphia  Difference
2016-04-01        80            70          10
2016-04-02        82            75           7
2016-04-03        85            69          16
2016-04-04        90            83           7
2016-04-05        83            79           4
2016-04-06        87            77          10

In [32]:
temp2_df.columns

Index(['Missoula', 'Philadelphia', 'Difference'], dtype='object')

In [33]:
temp2_df.Difference > 9

2016-04-01     True
2016-04-02    False
2016-04-03     True
2016-04-04    False
2016-04-05    False
2016-04-06     True
Freq: D, Name: Difference, dtype: bool

In [34]:
temp2_df[temp2_df.Difference > 9]

            Missoula  Philadelphia  Difference
2016-04-01        80            70          10
2016-04-03        85            69          16
2016-04-06        87            77          10